{
  "ir_version": 1,
  "generated_by": "neuralmind.ir.from_graph_json",
  "source_backend": "turbovec",
  "source_schema_version": 1,
  "built_at_commit": "",
  "created_at": "2026-06-28T02:38:13.599292+00:00",
  "coverage": "coarse",
  "nodes": [
    {
      "id": "marketplace_validator_validate_py",
      "kind": "file",
      "label": "validate.py",
      "source_file": "marketplace/validator/validate.py",
      "line": 1,
      "language": "python",
      "cluster": 31,
      "norm_label": "validate.py",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "marketplace_validator_validate_py__repo_root_sym",
      "kind": "symbol",
      "label": "REPO_ROOT",
      "source_file": "marketplace/validator/validate.py",
      "line": 9,
      "language": "python",
      "cluster": 31,
      "norm_label": "repo_root",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_mint_tag_py",
      "kind": "file",
      "label": "mint_tag.py",
      "source_file": "plugins/deploy/scripts/mint_tag.py",
      "line": 1,
      "language": "python",
      "cluster": 39,
      "norm_label": "mint_tag.py",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_mint_tag_py__env_to_prefix_sym",
      "kind": "symbol",
      "label": "ENV_TO_PREFIX",
      "source_file": "plugins/deploy/scripts/mint_tag.py",
      "line": 12,
      "language": "python",
      "cluster": 39,
      "norm_label": "env_to_prefix",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_mint_tag_py__version_re_sym",
      "kind": "symbol",
      "label": "VERSION_RE",
      "source_file": "plugins/deploy/scripts/mint_tag.py",
      "line": 18,
      "language": "python",
      "cluster": 39,
      "norm_label": "version_re",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_mint_tag_py__run_fn",
      "kind": "function",
      "label": "run()",
      "source_file": "plugins/deploy/scripts/mint_tag.py",
      "line": 21,
      "language": "python",
      "cluster": 39,
      "norm_label": "run()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_mint_tag_py__run_fn__rationale",
      "kind": "document",
      "label": "Run a command and return stdout.",
      "source_file": "plugins/deploy/scripts/mint_tag.py",
      "line": 21,
      "language": "python",
      "cluster": 39,
      "norm_label": "run a command and return stdout.",
      "confidence": 1.0,
      "raw_kind": "rationale",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_mint_tag_py__remote_to_repo_fn",
      "kind": "function",
      "label": "_remote_to_repo()",
      "source_file": "plugins/deploy/scripts/mint_tag.py",
      "line": 37,
      "language": "python",
      "cluster": 39,
      "norm_label": "_remote_to_repo()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_mint_tag_py__resolve_repo_fn",
      "kind": "function",
      "label": "resolve_repo()",
      "source_file": "plugins/deploy/scripts/mint_tag.py",
      "line": 52,
      "language": "python",
      "cluster": 39,
      "norm_label": "resolve_repo()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_mint_tag_py__resolve_repo_fn__rationale",
      "kind": "document",
      "label": "Resolve a repository name and reject non-Infiquetra owners.",
      "source_file": "plugins/deploy/scripts/mint_tag.py",
      "line": 52,
      "language": "python",
      "cluster": 39,
      "norm_label": "resolve a repository name and reject non-infiquetra owners.",
      "confidence": 1.0,
      "raw_kind": "rationale",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_mint_tag_py__build_tag_name_fn",
      "kind": "function",
      "label": "build_tag_name()",
      "source_file": "plugins/deploy/scripts/mint_tag.py",
      "line": 66,
      "language": "python",
      "cluster": 39,
      "norm_label": "build_tag_name()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_mint_tag_py__build_tag_name_fn__rationale",
      "kind": "document",
      "label": "Build an Infiquetra deployment tag name.",
      "source_file": "plugins/deploy/scripts/mint_tag.py",
      "line": 66,
      "language": "python",
      "cluster": 39,
      "norm_label": "build an infiquetra deployment tag name.",
      "confidence": 1.0,
      "raw_kind": "rationale",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_mint_tag_py__strip_prefix_fn",
      "kind": "function",
      "label": "strip_prefix()",
      "source_file": "plugins/deploy/scripts/mint_tag.py",
      "line": 84,
      "language": "python",
      "cluster": 39,
      "norm_label": "strip_prefix()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_mint_tag_py__strip_prefix_fn__rationale",
      "kind": "document",
      "label": "Strip Infiquetra deployment tag prefixes and return the version.",
      "source_file": "plugins/deploy/scripts/mint_tag.py",
      "line": 84,
      "language": "python",
      "cluster": 39,
      "norm_label": "strip infiquetra deployment tag prefixes and return the version.",
      "confidence": 1.0,
      "raw_kind": "rationale",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_mint_tag_py__current_env_version_fn",
      "kind": "function",
      "label": "current_env_version()",
      "source_file": "plugins/deploy/scripts/mint_tag.py",
      "line": 101,
      "language": "python",
      "cluster": 39,
      "norm_label": "current_env_version()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_mint_tag_py__current_env_version_fn__rationale",
      "kind": "document",
      "label": "Return the currently deployed version for an environment.",
      "source_file": "plugins/deploy/scripts/mint_tag.py",
      "line": 101,
      "language": "python",
      "cluster": 39,
      "norm_label": "return the currently deployed version for an environment.",
      "confidence": 1.0,
      "raw_kind": "rationale",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_mint_tag_py__tag_exists_fn",
      "kind": "function",
      "label": "tag_exists()",
      "source_file": "plugins/deploy/scripts/mint_tag.py",
      "line": 117,
      "language": "python",
      "cluster": 39,
      "norm_label": "tag_exists()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_mint_tag_py__tag_exists_fn__rationale",
      "kind": "document",
      "label": "Return whether a tag exists locally or on origin.",
      "source_file": "plugins/deploy/scripts/mint_tag.py",
      "line": 117,
      "language": "python",
      "cluster": 39,
      "norm_label": "return whether a tag exists locally or on origin.",
      "confidence": 1.0,
      "raw_kind": "rationale",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_mint_tag_py__latest_snapshot_version_fn",
      "kind": "function",
      "label": "latest_snapshot_version()",
      "source_file": "plugins/deploy/scripts/mint_tag.py",
      "line": 130,
      "language": "python",
      "cluster": 39,
      "norm_label": "latest_snapshot_version()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_mint_tag_py__latest_snapshot_version_fn__rationale",
      "kind": "document",
      "label": "Return the latest local or remote snapshot version.",
      "source_file": "plugins/deploy/scripts/mint_tag.py",
      "line": 130,
      "language": "python",
      "cluster": 39,
      "norm_label": "return the latest local or remote snapshot version.",
      "confidence": 1.0,
      "raw_kind": "rationale",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_mint_tag_py__resolve_version_fn",
      "kind": "function",
      "label": "resolve_version()",
      "source_file": "plugins/deploy/scripts/mint_tag.py",
      "line": 142,
      "language": "python",
      "cluster": 39,
      "norm_label": "resolve_version()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_mint_tag_py__resolve_version_fn__rationale",
      "kind": "document",
      "label": "Resolve explicit or inferred deployment version.",
      "source_file": "plugins/deploy/scripts/mint_tag.py",
      "line": 142,
      "language": "python",
      "cluster": 39,
      "norm_label": "resolve explicit or inferred deployment version.",
      "confidence": 1.0,
      "raw_kind": "rationale",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_mint_tag_py__assert_snapshot_not_unhealthy_fn",
      "kind": "function",
      "label": "assert_snapshot_not_unhealthy()",
      "source_file": "plugins/deploy/scripts/mint_tag.py",
      "line": 166,
      "language": "python",
      "cluster": 39,
      "norm_label": "assert_snapshot_not_unhealthy()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_mint_tag_py__assert_snapshot_not_unhealthy_fn__rationale",
      "kind": "document",
      "label": "Refuse to promote snapshots marked unhealthy unless explicitly overridden.",
      "source_file": "plugins/deploy/scripts/mint_tag.py",
      "line": 166,
      "language": "python",
      "cluster": 39,
      "norm_label": "refuse to promote snapshots marked unhealthy unless explicitly overridden.",
      "confidence": 1.0,
      "raw_kind": "rationale",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_mint_tag_py__print_plan_fn",
      "kind": "function",
      "label": "_print_plan()",
      "source_file": "plugins/deploy/scripts/mint_tag.py",
      "line": 191,
      "language": "python",
      "cluster": 39,
      "norm_label": "_print_plan()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_mint_tag_py__parse_args_fn",
      "kind": "function",
      "label": "parse_args()",
      "source_file": "plugins/deploy/scripts/mint_tag.py",
      "line": 199,
      "language": "python",
      "cluster": 39,
      "norm_label": "parse_args()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_mint_tag_py__main_fn",
      "kind": "function",
      "label": "main()",
      "source_file": "plugins/deploy/scripts/mint_tag.py",
      "line": 215,
      "language": "python",
      "cluster": 39,
      "norm_label": "main()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_preview_release_notes_py",
      "kind": "file",
      "label": "preview_release_notes.py",
      "source_file": "plugins/deploy/scripts/preview_release_notes.py",
      "line": 1,
      "language": "python",
      "cluster": 40,
      "norm_label": "preview_release_notes.py",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_preview_release_notes_py__run_fn",
      "kind": "function",
      "label": "run()",
      "source_file": "plugins/deploy/scripts/preview_release_notes.py",
      "line": 14,
      "language": "python",
      "cluster": 40,
      "norm_label": "run()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_preview_release_notes_py__render_notes_fn",
      "kind": "function",
      "label": "render_notes()",
      "source_file": "plugins/deploy/scripts/preview_release_notes.py",
      "line": 27,
      "language": "python",
      "cluster": 40,
      "norm_label": "render_notes()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_preview_release_notes_py__parse_args_fn",
      "kind": "function",
      "label": "parse_args()",
      "source_file": "plugins/deploy/scripts/preview_release_notes.py",
      "line": 46,
      "language": "python",
      "cluster": 40,
      "norm_label": "parse_args()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_preview_release_notes_py__main_fn",
      "kind": "function",
      "label": "main()",
      "source_file": "plugins/deploy/scripts/preview_release_notes.py",
      "line": 54,
      "language": "python",
      "cluster": 40,
      "norm_label": "main()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_query_deployments_py",
      "kind": "file",
      "label": "query_deployments.py",
      "source_file": "plugins/deploy/scripts/query_deployments.py",
      "line": 1,
      "language": "python",
      "cluster": 41,
      "norm_label": "query_deployments.py",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_query_deployments_py__environments_sym",
      "kind": "symbol",
      "label": "ENVIRONMENTS",
      "source_file": "plugins/deploy/scripts/query_deployments.py",
      "line": 13,
      "language": "python",
      "cluster": 41,
      "norm_label": "environments",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_query_deployments_py__tag_prefixes_sym",
      "kind": "symbol",
      "label": "TAG_PREFIXES",
      "source_file": "plugins/deploy/scripts/query_deployments.py",
      "line": 14,
      "language": "python",
      "cluster": 41,
      "norm_label": "tag_prefixes",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_query_deployments_py__run_fn",
      "kind": "function",
      "label": "run()",
      "source_file": "plugins/deploy/scripts/query_deployments.py",
      "line": 25,
      "language": "python",
      "cluster": 41,
      "norm_label": "run()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_query_deployments_py__strip_prefix_fn",
      "kind": "function",
      "label": "strip_prefix()",
      "source_file": "plugins/deploy/scripts/query_deployments.py",
      "line": 38,
      "language": "python",
      "cluster": 41,
      "norm_label": "strip_prefix()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_query_deployments_py__strip_prefix_fn__rationale",
      "kind": "document",
      "label": "Strip Infiquetra deployment tag prefixes for drift comparison.",
      "source_file": "plugins/deploy/scripts/query_deployments.py",
      "line": 38,
      "language": "python",
      "cluster": 41,
      "norm_label": "strip infiquetra deployment tag prefixes for drift comparison.",
      "confidence": 1.0,
      "raw_kind": "rationale",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_query_deployments_py__remote_to_repo_fn",
      "kind": "function",
      "label": "_remote_to_repo()",
      "source_file": "plugins/deploy/scripts/query_deployments.py",
      "line": 48,
      "language": "python",
      "cluster": 41,
      "norm_label": "_remote_to_repo()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_query_deployments_py__resolve_repo_fn",
      "kind": "function",
      "label": "resolve_repo()",
      "source_file": "plugins/deploy/scripts/query_deployments.py",
      "line": 63,
      "language": "python",
      "cluster": 41,
      "norm_label": "resolve_repo()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_query_deployments_py__detect_drift_fn",
      "kind": "function",
      "label": "detect_drift()",
      "source_file": "plugins/deploy/scripts/query_deployments.py",
      "line": 75,
      "language": "python",
      "cluster": 41,
      "norm_label": "detect_drift()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_query_deployments_py__is_tag_ref_fn",
      "kind": "function",
      "label": "is_tag_ref()",
      "source_file": "plugins/deploy/scripts/query_deployments.py",
      "line": 86,
      "language": "python",
      "cluster": 41,
      "norm_label": "is_tag_ref()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_query_deployments_py__is_tag_ref_fn__rationale",
      "kind": "document",
      "label": "True when ``ref`` is an Infiquetra deployment tag, not a branch/SHA ref. GitHub Actions ``environment:`` job keys auto-create Deployment records whose ref is a branch name or SHA (e.g. ``main``). Only",
      "source_file": "plugins/deploy/scripts/query_deployments.py",
      "line": 86,
      "language": "python",
      "cluster": 41,
      "norm_label": "true when ``ref`` is an infiquetra deployment tag, not a branch/sha ref. github actions ``environment:`` job keys auto-create deployment records whose ref is a branch name or sha (e.g. ``main``). only",
      "confidence": 1.0,
      "raw_kind": "rationale",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_query_deployments_py__latest_deployment_fn",
      "kind": "function",
      "label": "latest_deployment()",
      "source_file": "plugins/deploy/scripts/query_deployments.py",
      "line": 103,
      "language": "python",
      "cluster": 41,
      "norm_label": "latest_deployment()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_query_deployments_py__render_status_fn",
      "kind": "function",
      "label": "render_status()",
      "source_file": "plugins/deploy/scripts/query_deployments.py",
      "line": 124,
      "language": "python",
      "cluster": 41,
      "norm_label": "render_status()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_query_deployments_py__parse_args_fn",
      "kind": "function",
      "label": "parse_args()",
      "source_file": "plugins/deploy/scripts/query_deployments.py",
      "line": 148,
      "language": "python",
      "cluster": 41,
      "norm_label": "parse_args()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_deploy_scripts_query_deployments_py__main_fn",
      "kind": "function",
      "label": "main()",
      "source_file": "plugins/deploy/scripts/query_deployments.py",
      "line": 154,
      "language": "python",
      "cluster": 41,
      "norm_label": "main()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_config_generated_check_issue_contract_parity_py",
      "kind": "file",
      "label": "check_issue_contract_parity.py",
      "source_file": "plugins/mission-control/config/generated/check_issue_contract_parity.py",
      "line": 1,
      "language": "python",
      "cluster": 65,
      "norm_label": "check_issue_contract_parity.py",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_config_generated_check_issue_contract_parity_py__vendor_dir_sym",
      "kind": "symbol",
      "label": "VENDOR_DIR",
      "source_file": "plugins/mission-control/config/generated/check_issue_contract_parity.py",
      "line": 36,
      "language": "python",
      "cluster": 65,
      "norm_label": "vendor_dir",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_config_generated_check_issue_contract_parity_py__vendored_artifacts_sym",
      "kind": "symbol",
      "label": "VENDORED_ARTIFACTS",
      "source_file": "plugins/mission-control/config/generated/check_issue_contract_parity.py",
      "line": 40,
      "language": "python",
      "cluster": 65,
      "norm_label": "vendored_artifacts",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_config_generated_check_issue_contract_parity_py__sha_path_fn",
      "kind": "function",
      "label": "_sha_path()",
      "source_file": "plugins/mission-control/config/generated/check_issue_contract_parity.py",
      "line": 46,
      "language": "python",
      "cluster": 65,
      "norm_label": "_sha_path()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_config_generated_check_issue_contract_parity_py__sha_path_fn__rationale",
      "kind": "document",
      "label": "The pinned-SHA sidecar manifest path for a vendored artifact.",
      "source_file": "plugins/mission-control/config/generated/check_issue_contract_parity.py",
      "line": 46,
      "language": "python",
      "cluster": 65,
      "norm_label": "the pinned-sha sidecar manifest path for a vendored artifact.",
      "confidence": 1.0,
      "raw_kind": "rationale",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_config_generated_check_issue_contract_parity_py__parity_errors_fn",
      "kind": "function",
      "label": "parity_errors()",
      "source_file": "plugins/mission-control/config/generated/check_issue_contract_parity.py",
      "line": 51,
      "language": "python",
      "cluster": 65,
      "norm_label": "parity_errors()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_config_generated_check_issue_contract_parity_py__parity_errors_fn__rationale",
      "kind": "document",
      "label": "Return human-readable parity violations across every vendored artifact; empty list = all in sync.",
      "source_file": "plugins/mission-control/config/generated/check_issue_contract_parity.py",
      "line": 51,
      "language": "python",
      "cluster": 65,
      "norm_label": "return human-readable parity violations across every vendored artifact; empty list = all in sync.",
      "confidence": 1.0,
      "raw_kind": "rationale",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_config_generated_check_issue_contract_parity_py__main_fn",
      "kind": "function",
      "label": "main()",
      "source_file": "plugins/mission-control/config/generated/check_issue_contract_parity.py",
      "line": 77,
      "language": "python",
      "cluster": 65,
      "norm_label": "main()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_config_generated_issue_contract_data_py",
      "kind": "file",
      "label": "issue_contract_data.py",
      "source_file": "plugins/mission-control/config/generated/issue_contract_data.py",
      "line": 1,
      "language": "python",
      "cluster": 66,
      "norm_label": "issue_contract_data.py",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_config_generated_issue_contract_data_py__rationale",
      "kind": "document",
      "label": "Generated issue-contract validator DATA. DO NOT EDIT. Generated by tools/docs/gen_issue_contract.py from the issue_fields block in config/sdlc-schema.json (U2: full field set, faithfully extracted fro",
      "source_file": "plugins/mission-control/config/generated/issue_contract_data.py",
      "line": 1,
      "language": "python",
      "cluster": 66,
      "norm_label": "generated issue-contract validator data. do not edit. generated by tools/docs/gen_issue_contract.py from the issue_fields block in config/sdlc-schema.json (u2: full field set, faithfully extracted fro",
      "confidence": 1.0,
      "raw_kind": "rationale",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_config_generated_issue_contract_data_py__field_headers_sym",
      "kind": "symbol",
      "label": "FIELD_HEADERS",
      "source_file": "plugins/mission-control/config/generated/issue_contract_data.py",
      "line": 15,
      "language": "python",
      "cluster": 66,
      "norm_label": "field_headers",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_config_generated_issue_contract_data_py__required_fields_sym",
      "kind": "symbol",
      "label": "REQUIRED_FIELDS",
      "source_file": "plugins/mission-control/config/generated/issue_contract_data.py",
      "line": 31,
      "language": "python",
      "cluster": 66,
      "norm_label": "required_fields",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_config_generated_issue_contract_data_py__header_re_pattern_sym",
      "kind": "symbol",
      "label": "HEADER_RE_PATTERN",
      "source_file": "plugins/mission-control/config/generated/issue_contract_data.py",
      "line": 44,
      "language": "python",
      "cluster": 66,
      "norm_label": "header_re_pattern",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_config_generated_issue_contract_data_py__header_re_flags_sym",
      "kind": "symbol",
      "label": "HEADER_RE_FLAGS",
      "source_file": "plugins/mission-control/config/generated/issue_contract_data.py",
      "line": 45,
      "language": "python",
      "cluster": 66,
      "norm_label": "header_re_flags",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_config_generated_issue_contract_data_py__semantic_checks_sym",
      "kind": "symbol",
      "label": "SEMANTIC_CHECKS",
      "source_file": "plugins/mission-control/config/generated/issue_contract_data.py",
      "line": 49,
      "language": "python",
      "cluster": 66,
      "norm_label": "semantic_checks",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_config_generated_issue_contract_data_py__executable_checks_sym",
      "kind": "symbol",
      "label": "EXECUTABLE_CHECKS",
      "source_file": "plugins/mission-control/config/generated/issue_contract_data.py",
      "line": 70,
      "language": "python",
      "cluster": 66,
      "norm_label": "executable_checks",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_config_generated_issue_contract_data_py__context_parsing_sym",
      "kind": "symbol",
      "label": "CONTEXT_PARSING",
      "source_file": "plugins/mission-control/config/generated/issue_contract_data.py",
      "line": 80,
      "language": "python",
      "cluster": 66,
      "norm_label": "context_parsing",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_config_generated_issue_contract_data_py__placeholder_lines_sym",
      "kind": "symbol",
      "label": "PLACEHOLDER_LINES",
      "source_file": "plugins/mission-control/config/generated/issue_contract_data.py",
      "line": 90,
      "language": "python",
      "cluster": 66,
      "norm_label": "placeholder_lines",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_config_generated_issue_contract_data_py__required_matrix_sym",
      "kind": "symbol",
      "label": "REQUIRED_MATRIX",
      "source_file": "plugins/mission-control/config/generated/issue_contract_data.py",
      "line": 103,
      "language": "python",
      "cluster": 66,
      "norm_label": "required_matrix",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_config_generated_issue_contract_shim_py",
      "kind": "file",
      "label": "issue_contract_shim.py",
      "source_file": "plugins/mission-control/config/generated/issue_contract_shim.py",
      "line": 1,
      "language": "python",
      "cluster": 67,
      "norm_label": "issue_contract_shim.py",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_config_generated_issue_contract_shim_py__rationale",
      "kind": "document",
      "label": "Generated mission-control shim DATA. DO NOT EDIT. Generated by tools/docs/gen_issue_contract.py from the issue_fields block in config/sdlc-schema.json (U2: full field set, faithfully extracted from ca",
      "source_file": "plugins/mission-control/config/generated/issue_contract_shim.py",
      "line": 1,
      "language": "python",
      "cluster": 67,
      "norm_label": "generated mission-control shim data. do not edit. generated by tools/docs/gen_issue_contract.py from the issue_fields block in config/sdlc-schema.json (u2: full field set, faithfully extracted from ca",
      "confidence": 1.0,
      "raw_kind": "rationale",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_config_generated_issue_contract_shim_py__required_h3_headers_sym",
      "kind": "symbol",
      "label": "REQUIRED_H3_HEADERS",
      "source_file": "plugins/mission-control/config/generated/issue_contract_shim.py",
      "line": 18,
      "language": "python",
      "cluster": 67,
      "norm_label": "required_h3_headers",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_config_generated_issue_contract_shim_py__optional_h3_headers_sym",
      "kind": "symbol",
      "label": "OPTIONAL_H3_HEADERS",
      "source_file": "plugins/mission-control/config/generated/issue_contract_shim.py",
      "line": 29,
      "language": "python",
      "cluster": 67,
      "norm_label": "optional_h3_headers",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_config_generated_issue_contract_shim_py__header_re_pattern_sym",
      "kind": "symbol",
      "label": "HEADER_RE_PATTERN",
      "source_file": "plugins/mission-control/config/generated/issue_contract_shim.py",
      "line": 41,
      "language": "python",
      "cluster": 67,
      "norm_label": "header_re_pattern",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_config_generated_issue_contract_shim_py__checklist_re_pattern_sym",
      "kind": "symbol",
      "label": "CHECKLIST_RE_PATTERN",
      "source_file": "plugins/mission-control/config/generated/issue_contract_shim.py",
      "line": 42,
      "language": "python",
      "cluster": 67,
      "norm_label": "checklist_re_pattern",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_config_generated_issue_contract_shim_py__code_block_re_pattern_sym",
      "kind": "symbol",
      "label": "CODE_BLOCK_RE_PATTERN",
      "source_file": "plugins/mission-control/config/generated/issue_contract_shim.py",
      "line": 43,
      "language": "python",
      "cluster": 67,
      "norm_label": "code_block_re_pattern",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_config_generated_issue_contract_shim_py__path_line_re_pattern_sym",
      "kind": "symbol",
      "label": "PATH_LINE_RE_PATTERN",
      "source_file": "plugins/mission-control/config/generated/issue_contract_shim.py",
      "line": 44,
      "language": "python",
      "cluster": 67,
      "norm_label": "path_line_re_pattern",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_config_generated_issue_contract_shim_py__acceptance_executable_re_pattern_sym",
      "kind": "symbol",
      "label": "ACCEPTANCE_EXECUTABLE_RE_PATTERN",
      "source_file": "plugins/mission-control/config/generated/issue_contract_shim.py",
      "line": 47,
      "language": "python",
      "cluster": 67,
      "norm_label": "acceptance_executable_re_pattern",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_config_generated_issue_contract_shim_py__semantic_checks_sym",
      "kind": "symbol",
      "label": "SEMANTIC_CHECKS",
      "source_file": "plugins/mission-control/config/generated/issue_contract_shim.py",
      "line": 50,
      "language": "python",
      "cluster": 67,
      "norm_label": "semantic_checks",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_config_generated_issue_contract_shim_py__executable_checks_sym",
      "kind": "symbol",
      "label": "EXECUTABLE_CHECKS",
      "source_file": "plugins/mission-control/config/generated/issue_contract_shim.py",
      "line": 69,
      "language": "python",
      "cluster": 67,
      "norm_label": "executable_checks",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_config_generated_issue_contract_shim_py__placeholder_lines_sym",
      "kind": "symbol",
      "label": "PLACEHOLDER_LINES",
      "source_file": "plugins/mission-control/config/generated/issue_contract_shim.py",
      "line": 79,
      "language": "python",
      "cluster": 67,
      "norm_label": "placeholder_lines",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_scripts_sdlc_manager_py",
      "kind": "file",
      "label": "sdlc_manager.py",
      "source_file": "plugins/mission-control/scripts/sdlc_manager.py",
      "line": 1,
      "language": "python",
      "cluster": 68,
      "norm_label": "sdlc_manager.py",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_scripts_sdlc_manager_py__org_sym",
      "kind": "symbol",
      "label": "ORG",
      "source_file": "plugins/mission-control/scripts/sdlc_manager.py",
      "line": 81,
      "language": "python",
      "cluster": 68,
      "norm_label": "org",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_scripts_sdlc_manager_py__get_sdlc_path_fn",
      "kind": "function",
      "label": "get_sdlc_path()",
      "source_file": "plugins/mission-control/scripts/sdlc_manager.py",
      "line": 84,
      "language": "python",
      "cluster": 68,
      "norm_label": "get_sdlc_path()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_scripts_sdlc_manager_py__get_sdlc_path_fn__rationale",
      "kind": "document",
      "label": "Get path to infiquetra-sdlc checkout.",
      "source_file": "plugins/mission-control/scripts/sdlc_manager.py",
      "line": 84,
      "language": "python",
      "cluster": 68,
      "norm_label": "get path to infiquetra-sdlc checkout.",
      "confidence": 1.0,
      "raw_kind": "rationale",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_scripts_sdlc_manager_py__user_defaults_path_sym",
      "kind": "symbol",
      "label": "_USER_DEFAULTS_PATH",
      "source_file": "plugins/mission-control/scripts/sdlc_manager.py",
      "line": 100,
      "language": "python",
      "cluster": 68,
      "norm_label": "_user_defaults_path",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_scripts_sdlc_manager_py__user_defaults_keys_sym",
      "kind": "symbol",
      "label": "_USER_DEFAULTS_KEYS",
      "source_file": "plugins/mission-control/scripts/sdlc_manager.py",
      "line": 104,
      "language": "python",
      "cluster": 68,
      "norm_label": "_user_defaults_keys",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_scripts_sdlc_manager_py__load_user_defaults_fn",
      "kind": "function",
      "label": "load_user_defaults()",
      "source_file": "plugins/mission-control/scripts/sdlc_manager.py",
      "line": 115,
      "language": "python",
      "cluster": 68,
      "norm_label": "load_user_defaults()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_scripts_sdlc_manager_py__load_user_defaults_fn__rationale",
      "kind": "document",
      "label": "Read ~/.gemini/sdlc-defaults.json. Returns {} on: - file missing (first run) - malformed JSON (warn + return {}) - non-object root (warn + return {}) - unreadable file / encoding errors (warn + return",
      "source_file": "plugins/mission-control/scripts/sdlc_manager.py",
      "line": 115,
      "language": "python",
      "cluster": 68,
      "norm_label": "read ~/.gemini/sdlc-defaults.json. returns {} on: - file missing (first run) - malformed json (warn + return {}) - non-object root (warn + return {}) - unreadable file / encoding errors (warn + return",
      "confidence": 1.0,
      "raw_kind": "rationale",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_scripts_sdlc_manager_py__save_user_defaults_fn",
      "kind": "function",
      "label": "save_user_defaults()",
      "source_file": "plugins/mission-control/scripts/sdlc_manager.py",
      "line": 146,
      "language": "python",
      "cluster": 68,
      "norm_label": "save_user_defaults()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_scripts_sdlc_manager_py__save_user_defaults_fn__rationale",
      "kind": "document",
      "label": "Atomically write ~/.gemini/sdlc-defaults.json. Creates parent dir if missing. Atomic via tempfile + rename so a crash mid-write doesn't corrupt the file.",
      "source_file": "plugins/mission-control/scripts/sdlc_manager.py",
      "line": 146,
      "language": "python",
      "cluster": 68,
      "norm_label": "atomically write ~/.gemini/sdlc-defaults.json. creates parent dir if missing. atomic via tempfile + rename so a crash mid-write doesn't corrupt the file.",
      "confidence": 1.0,
      "raw_kind": "rationale",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_scripts_sdlc_manager_py__get_default_fn",
      "kind": "function",
      "label": "get_default()",
      "source_file": "plugins/mission-control/scripts/sdlc_manager.py",
      "line": 158,
      "language": "python",
      "cluster": 68,
      "norm_label": "get_default()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_scripts_sdlc_manager_py__get_default_fn__rationale",
      "kind": "document",
      "label": "Convenience: read a single default. Returns None if not set.",
      "source_file": "plugins/mission-control/scripts/sdlc_manager.py",
      "line": 158,
      "language": "python",
      "cluster": 68,
      "norm_label": "convenience: read a single default. returns none if not set.",
      "confidence": 1.0,
      "raw_kind": "rationale",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_scripts_sdlc_manager_py__fetch_gh_login_fn",
      "kind": "function",
      "label": "_fetch_gh_login()",
      "source_file": "plugins/mission-control/scripts/sdlc_manager.py",
      "line": 163,
      "language": "python",
      "cluster": 68,
      "norm_label": "_fetch_gh_login()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_scripts_sdlc_manager_py__fetch_gh_login_fn__rationale",
      "kind": "document",
      "label": "Get the operator's gh login via `gh api user --jq .login`. Returns None if gh is unauthenticated or the call fails \u2014 caller decides what to do. Importantly, NOT $USER (which can differ from the gh log",
      "source_file": "plugins/mission-control/scripts/sdlc_manager.py",
      "line": 163,
      "language": "python",
      "cluster": 68,
      "norm_label": "get the operator's gh login via `gh api user --jq .login`. returns none if gh is unauthenticated or the call fails \u2014 caller decides what to do. importantly, not $user (which can differ from the gh log",
      "confidence": 1.0,
      "raw_kind": "rationale",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_scripts_sdlc_manager_py__load_config_fn",
      "kind": "function",
      "label": "load_config()",
      "source_file": "plugins/mission-control/scripts/sdlc_manager.py",
      "line": 173,
      "language": "python",
      "cluster": 68,
      "norm_label": "load_config()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_scripts_sdlc_manager_py__load_config_fn__rationale",
      "kind": "document",
      "label": "Load SDLC config, preferring live canonical sources when freshness matters.",
      "source_file": "plugins/mission-control/scripts/sdlc_manager.py",
      "line": 173,
      "language": "python",
      "cluster": 68,
      "norm_label": "load sdlc config, preferring live canonical sources when freshness matters.",
      "confidence": 1.0,
      "raw_kind": "rationale",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_scripts_sdlc_manager_py__vendored_project_mappings_path_sym",
      "kind": "symbol",
      "label": "_VENDORED_PROJECT_MAPPINGS_PATH",
      "source_file": "plugins/mission-control/scripts/sdlc_manager.py",
      "line": 238,
      "language": "python",
      "cluster": 68,
      "norm_label": "_vendored_project_mappings_path",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_scripts_sdlc_manager_py__vendored_sdlc_schema_path_sym",
      "kind": "symbol",
      "label": "_VENDORED_SDLC_SCHEMA_PATH",
      "source_file": "plugins/mission-control/scripts/sdlc_manager.py",
      "line": 241,
      "language": "python",
      "cluster": 68,
      "norm_label": "_vendored_sdlc_schema_path",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_scripts_sdlc_manager_py__project_choices_sym",
      "kind": "symbol",
      "label": "PROJECT_CHOICES",
      "source_file": "plugins/mission-control/scripts/sdlc_manager.py",
      "line": 246,
      "language": "python",
      "cluster": 68,
      "norm_label": "project_choices",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_scripts_sdlc_manager_py__live_legacy_status_aliases_sym",
      "kind": "symbol",
      "label": "LIVE_LEGACY_STATUS_ALIASES",
      "source_file": "plugins/mission-control/scripts/sdlc_manager.py",
      "line": 247,
      "language": "python",
      "cluster": 68,
      "norm_label": "live_legacy_status_aliases",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_scripts_sdlc_manager_py__resolve_project_mappings_fn",
      "kind": "function",
      "label": "_resolve_project_mappings()",
      "source_file": "plugins/mission-control/scripts/sdlc_manager.py",
      "line": 256,
      "language": "python",
      "cluster": 68,
      "norm_label": "_resolve_project_mappings()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_scripts_sdlc_manager_py__resolve_project_mappings_fn__rationale",
      "kind": "document",
      "label": "Resolve project-mappings.json via the documented order: external override \u2192 vendored \u2192 remote fallback. Returns {} if all fail.",
      "source_file": "plugins/mission-control/scripts/sdlc_manager.py",
      "line": 256,
      "language": "python",
      "cluster": 68,
      "norm_label": "resolve project-mappings.json via the documented order: external override \u2192 vendored \u2192 remote fallback. returns {} if all fail.",
      "confidence": 1.0,
      "raw_kind": "rationale",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_scripts_sdlc_manager_py__resolve_sdlc_schema_fn",
      "kind": "function",
      "label": "_resolve_sdlc_schema()",
      "source_file": "plugins/mission-control/scripts/sdlc_manager.py",
      "line": 291,
      "language": "python",
      "cluster": 68,
      "norm_label": "_resolve_sdlc_schema()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_scripts_sdlc_manager_py__resolve_sdlc_schema_fn__rationale",
      "kind": "document",
      "label": "Resolve sdlc-schema.json via GitHub main \u2192 vendored \u2192 local fallback.",
      "source_file": "plugins/mission-control/scripts/sdlc_manager.py",
      "line": 291,
      "language": "python",
      "cluster": 68,
      "norm_label": "resolve sdlc-schema.json via github main \u2192 vendored \u2192 local fallback.",
      "confidence": 1.0,
      "raw_kind": "rationale",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_scripts_sdlc_manager_py__get_project_config_fn",
      "kind": "function",
      "label": "get_project_config()",
      "source_file": "plugins/mission-control/scripts/sdlc_manager.py",
      "line": 322,
      "language": "python",
      "cluster": 68,
      "norm_label": "get_project_config()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_scripts_sdlc_manager_py__get_project_config_fn__rationale",
      "kind": "document",
      "label": "Get config for a specific project.",
      "source_file": "plugins/mission-control/scripts/sdlc_manager.py",
      "line": 322,
      "language": "python",
      "cluster": 68,
      "norm_label": "get config for a specific project.",
      "confidence": 1.0,
      "raw_kind": "rationale",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_scripts_sdlc_manager_py__project_board_key_fn",
      "kind": "function",
      "label": "_project_board_key()",
      "source_file": "plugins/mission-control/scripts/sdlc_manager.py",
      "line": 331,
      "language": "python",
      "cluster": 68,
      "norm_label": "_project_board_key()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_scripts_sdlc_manager_py__project_board_key_fn__rationale",
      "kind": "document",
      "label": "Return the SDLC schema board key for a project mapping.",
      "source_file": "plugins/mission-control/scripts/sdlc_manager.py",
      "line": 331,
      "language": "python",
      "cluster": 68,
      "norm_label": "return the sdlc schema board key for a project mapping.",
      "confidence": 1.0,
      "raw_kind": "rationale",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_scripts_sdlc_manager_py__project_workflow_name_fn",
      "kind": "function",
      "label": "_project_workflow_name()",
      "source_file": "plugins/mission-control/scripts/sdlc_manager.py",
      "line": 340,
      "language": "python",
      "cluster": 68,
      "norm_label": "_project_workflow_name()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_scripts_sdlc_manager_py__project_workflow_name_fn__rationale",
      "kind": "document",
      "label": "Return the workflow name for a project mapping.",
      "source_file": "plugins/mission-control/scripts/sdlc_manager.py",
      "line": 340,
      "language": "python",
      "cluster": 68,
      "norm_label": "return the workflow name for a project mapping.",
      "confidence": 1.0,
      "raw_kind": "rationale",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_scripts_sdlc_manager_py__project_workflow_fn",
      "kind": "function",
      "label": "_project_workflow()",
      "source_file": "plugins/mission-control/scripts/sdlc_manager.py",
      "line": 352,
      "language": "python",
      "cluster": 68,
      "norm_label": "_project_workflow()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_scripts_sdlc_manager_py__project_workflow_fn__rationale",
      "kind": "document",
      "label": "Return the workflow config for a project, or an empty fallback.",
      "source_file": "plugins/mission-control/scripts/sdlc_manager.py",
      "line": 352,
      "language": "python",
      "cluster": 68,
      "norm_label": "return the workflow config for a project, or an empty fallback.",
      "confidence": 1.0,
      "raw_kind": "rationale",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_scripts_sdlc_manager_py__status_order_fn",
      "kind": "function",
      "label": "_status_order()",
      "source_file": "plugins/mission-control/scripts/sdlc_manager.py",
      "line": 359,
      "language": "python",
      "cluster": 68,
      "norm_label": "_status_order()",
      "confidence": 1.0,
      "raw_kind": "code",
      "extra": {}
    },
    {
      "id": "plugins_mission_control_scripts_sdlc_manager_py__status_order_fn__rationale",
      "kind": "document",
      "label": "Return schema-backed display order with live/legacy statuses appended.",
      "source_file": "plugins/mission-control/scripts/sdlc_manager.py",
